basecamelectronics/sbgc32-serial-api/examples/STM32/MimicControl/Core/Inc/serialAPI_Config.h
/**	____________________________________________________________________
 *
 *	SBGC32 Serial API Library v2.0
 *
 *	@file		serialAPI_ConfigTemplate.h
 *
 *	@brief 		Configuration header file of the library
 *	____________________________________________________________________
 *
 *	@attention	<h3><center>
 *				Copyright © 2024 BaseCam Electronics™.<br>
 *				All rights reserved.
 *				</center></h3>
 *
 *				<center><a href="https://www.basecamelectronics.com">
 *				www.basecamelectronics.com</a></center>
 *
 *	Licensed under the Apache License, Version 2.0 (the "License");
 *	you may not use this file except in compliance with the License.
 *	You may obtain a copy of the License at
 *
 *	http://www.apache.org/licenses/LICENSE-2.0
 *
 *	Unless required by applicable law or agreed to in writing, software
 *	distributed under the License is distributed on an "AS IS" BASIS,
 *	WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
 *	implied. See the License for the specific language governing
 *	permissions and limitations under the License.
 *	____________________________________________________________________
 */
/**	____________________________________________________________________
 *
 *	@defgroup	Configurations Serial API Configurations
 *	@ingroup	Common
 *		@brief	Serial API Configuration header file
 *	____________________________________________________________________
 */

#ifndef		SERIAL_API_CONFIG_TEMPLATE_H_
#define		SERIAL_API_CONFIG_TEMPLATE_H_

#ifdef		__cplusplus
extern		"C" {
#endif
/*  = = = = = = = = = = = = = = = = = = = = = = = */

/* Disable and enable parameters */
#define		sbgcOFF					(0)
#define		sbgcON					(-1)


/**	@addtogroup	Configurations
 *	@{
 */
/* ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 *								Module Configuration
 */
/* Link various library functions,
   divided into modules */
#define		SBGC_ADJVAR_MODULE		sbgcOFF			/*!<  Adjustable variables. See @ref Adjvar module									*/
#define		SBGC_CALIB_MODULE		sbgcOFF			/*!<  Calibration functions. See @ref Calib module									*/
#define		SBGC_EEPROM_MODULE		sbgcOFF			/*!<  EEPROM operations. See @ref EEPROM module										*/
#define		SBGC_CONTROL_MODULE		sbgcON			/*!<  Gimbal control. See @ref Gimbal_Control module								*/
#define		SBGC_IMU_MODULE			sbgcOFF			/*!<  IMU data functions. See @ref IMU module										*/
#define		SBGC_PROFILES_MODULE	sbgcOFF			/*!<  Profile configurations. See @ref Profiles module								*/
#define		SBGC_REALTIME_MODULE	sbgcOFF			/*!<  Realtime data processing. See @ref Realtime module							*/
#define		SBGC_SERVICE_MODULE		sbgcON			/*!<  Service functions. See @ref Service module									*/


/* ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 *					  Main Serial API Configurations
 */
#define		SBGC_SYS_BIG_ENDIAN		sbgcOFF			/*!<  Memory organization of target-control device. LITTLE ENDIAN if set off		*/
#define		SBGC_SEVERAL_DEVICES	sbgcOFF			/*!<  Using more than one controller with the library								*/
#define		SBGC_PROTOCOL_VERSION	2				/*!<  V.1 or V.2 SerialAPI protocol version											*/

#define		SBGC_NON_BLOCKING_MODE	sbgcOFF			/*!<  Provide the library with non-blocking communication							*/
#if (SBGC_NON_BLOCKING_MODE)
	#define	SBGC_NEED_TOKENS		sbgcOFF			/*!<  Add a special token to keep track current SBGC32_ request						*/
	#define	SBGC_NEED_CALLBACKS		sbgcOFF			/*!<  Add the callbacks from the SBGC32_ functions to the user's custom events		*/
	#define	SBGC_OPTIMIZE_COMMANDS	sbgcOFF			/*!<  Suppress the new commands if there is the same command in buffer				*/
	#define	SBGC_SEND_IMMEDIATELY	sbgcOFF			/*!<  Send serial commands right away without calling processing functions			*/
	#define	SBGC_MAX_COMMAND_NUM	2				/*!<  1 Min --> 255 Max. Maximum number of serial commands processed simultaneously	*/
#endif

#define		SBGC_TX_BUFFER_SIZE		1				/*!<  1 Min (256 bytes) --> 8 Max (32768 bytes). Buffer size for sent commands		*/
#define		SBGC_RX_BUFFER_SIZE		1				/*!<  1 Min (256 bytes) --> 8 Max (32768 bytes). Buffer size for received commands	*/
#define		SBGC_RX_CMD_OLD_PRIOR	sbgcOFF			/*!<  If set on, a buffer wouldn't save the new commands to prevent overflow.
														  In this case they should be taken manually by its corresponding functions		*/
#define		SBGC_NEED_DEBUG			sbgcOFF			/*!<  The system will print debug messages using callback function in driver		*/
#if (SBGC_NEED_DEBUG)
	#define	SBGC_LOG_COMMAND_NUMBER	sbgcOFF			/*!<  Add serial command number to log												*/
	#define	SBGC_LOG_COMMAND_DIR	sbgcOFF			/*!<  Add serial command type (Tx/Rx) to log										*/
	#define	SBGC_LOG_COMMAND_NAME	sbgcOFF			/*!<  Add serial command name to log												*/
	#define	SBGC_LOG_COMMAND_ID		sbgcOFF			/*!<  Add serial command ID to log													*/
	#define	SBGC_LOG_COMMAND_STATUS	sbgcOFF			/*!<  Add serial command status to log												*/
	#define	SBGC_LOG_COMMAND_PARAM	sbgcOFF			/*!<  Add serial command parameter to log											*/
	#define	SBGC_LOG_COMMAND_DATA	sbgcOFF			/*!<  Add serial command raw payload to log											*/
	#define	SBGC_CUSTOM_SPRINTF		sbgcOFF			/*!<  Allow to use a custom sprintf function to optimize resources usage. Use the
														  @ref SerialAPI_LinkSprintf function to link a custom sprintf to the library	*/
#endif

#define		SBGC_NEED_ASSERTS		sbgcOFF			/*!<  Allow commands assert															*/
#define		SBGC_NEED_CONFIRM_CMD	sbgcON			/*!<  Service flag that responsible for CMD_CONFIRM commands handling				*/
#define		SBGC_NEED_REF_INFO		sbgcOFF			/*!<  Debug mode flag for getting access to auxiliary info about system parameters	*/

#define		SBGC_DEFAULT_TIMEOUT	100				/*!<  Units: milliseconds. Default timeout for serial commands						*/
#define		SBGC_STARTUP_DELAY		500				/*!<  Units: milliseconds. System startup delay parameter							*/

#define		ROLL					0				/*!<  Serial number according to the Euler order. 0 - default value					*/
#define		PITCH					1				/*!<  Serial number according to the Euler order. 1 - default value					*/
#define		YAW						2				/*!<  Serial number according to the Euler order. 2 - default value					*/

