basecamelectronics/sbgc32-serial-api/examples/STM32/MimicControl/Core/Inc/serialAPI_Config.h
#if (SBGC_ADJVAR_MODULE)
	#define	SBGC_ADJ_VARS_REF_INFO	sbgcOFF			/*!<  Debug mode flag for getting access to auxiliary adjustable variable info		*/
	#define	SBGC_ADJ_VARS_NAMES		sbgcOFF			/*!<  Add names to adjustable variable definition									*/
	#define	SBGC_ADJ_VARS_ADD_FLAG	sbgcOFF			/*!<  Extend adjustable variables structure by user-defined variables				*/
#endif

#if (defined (SBGC_ADJ_VARS_ADD_FLAG) && SBGC_ADJ_VARS_ADD_FLAG)

	/**	@brief	User-defined additional parameters
	 *			for adjustable variables.
	 *			It may be expanded
	 *
	 *	@ref	sbgcAdjVarGeneral_t structure
	 */
	typedef struct
	{
		unsigned char		parameter1;				/*!<  Customizable parameter of adjustable variable									*/

	}	sbgcAdjVarCustFld_t;

#endif


/* ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 *						   OS Support Configurations
 */
#define		SBGC_USE_AZURE_RTOS		sbgcOFF			/*!<  User's applications uses Azure RTOS. Enable support of Azure RTOS				*/
#define		SBGC_USE_FREE_RTOS		sbgcOFF			/*!<  User's applications uses FreeRTOS. Enable support of FreeRTOS					*/
#if (SBGC_USE_AZURE_RTOS || SBGC_USE_FREE_RTOS)
	#define	SBGC_THREAD_STACK_SIZE	256				/*!<  SBGC32 handler thread stack usage volume										*/
	#define	SBGC_THREAD_PRIOR		3				/*!<  SBGC32 handler thread priority												*/
#endif

#define		SBGC_USE_LINUX_OS		sbgcOFF			/*!<  User's application uses Linux OS (POSIX). Enable support of POSIX Thread		*/


/* ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
 *							   Driver Configurations
 */
#define		SBGC_USE_ARDUINO_DRIVER	sbgcOFF			/*!<  Using an Arduino board as a master device										*/
#define		SBGC_USE_LINUX_DRIVER	sbgcOFF			/*!<  Using a Linux machine as a master device										*/
#define		SBGC_USE_STM32_DRIVER	sbgcON			/*!<  Using a STM32 controller as a master device									*/


#if (SBGC_USE_ARDUINO_DRIVER && (SBGC_SEVERAL_DEVICES == sbgcOFF))
	/**	@addtogroup	Arduino_Driver
	 *	@{
	 */
	/* Arduino Driver Common Configurations --------
	 */
	/*	Attention!
		SERIAL_TX_BUFFER_SIZE and SERIAL_RX_BUFFER_SIZE
		in the "HardwareSerial.h" library must be
		fixed to 256 value
	 */
	/**	@cond
	 */
	#define	SBGC_SERIAL_PORT		Serial1			/*!<  SBGCs UART serial port														*/

	#if (SBGC_NEED_DEBUG)
		#define	SBGC_DEBUG_SERIAL_PORT		Serial	/*!<  Debug UART serial port														*/
	#endif

	#define	SBGC_SERIAL_SPEED		115200			/*!<  SBGCs UART serial speed														*/

	#if (SBGC_NEED_DEBUG)
		#define	SBGC_DEBUG_SERIAL_SPEED		115200	/*!<  Debug UART serial speed														*/
	#endif
	/**	@endcond
	 */
	/**	@}
	 */
#endif /* SBGC_USE_ARDUINO_DRIVER */


#if (SBGC_USE_LINUX_DRIVER && (SBGC_SEVERAL_DEVICES == sbgcOFF))
	/**	@addtogroup	Linux_Driver
	 *	@{
	 */
	/* Linux Driver Common Configurations ----------
	 */
	/*	Attention!
		The serial port must have extended rights:
		sudo chmod a+rwx /dev/ttyUSB0
	 */
	/**	@cond
	 */
	#define SBGC_SERIAL_PORT		"/dev/ttyUSB0"	/*!<  Path to a connected SBGC32 device												*/

	#define SBGC_SERIAL_SPEED		B115200			/*!<  SBGCs COM-port serial speed													*/
	/**	@endcond
	 */
	/**	@}
	 */
#endif /* SBGC_USE_LINUX_DRIVER */


#if (SBGC_USE_STM32_DRIVER)
	/**	@addtogroup	STM32_Driver
	 *	@{
	 */
	/* STM32 Driver Common Configurations ----------
	 */
	#define	SBGC_DRV_USE_CUBEMX		sbgcON			/*!<  If set off whole SBGC32 driver configured manually
														  through HAL or LL without CubeMX												*/

	#if (!(SBGC_USE_FREE_RTOS || SBGC_USE_AZURE_RTOS))
		#define	SBGC_DRV_HAL_TIMER	sbgcON			/*!<  Timer driver works with NVIC through HAL										*/
		#define	SBGC_DRV_LL_TIMER	sbgcOFF			/*!<  Timer driver works with NVIC through LL										*/

		/*	Attention!
			*** Using reference timer copy this code
			into the TIMx_IRQHandler() function
			(if you are use HAL drivers - above
			the HAL_TIM_IRQHandler(&htimx))
			function in the stm32XXxx_it.c file:

			sbgcTimerIRQ_Handler(&SBGC32_Device);

			where the 'SBGC32_Device' is a general
			SBGC32 configurations structure
		 */
	#endif

	#define	SBGC_DRV_HAL_NVIC_UART	sbgcON			/*!<  UART driver works with NVIC through HAL										*/
	#define	SBGC_DRV_HAL_DMA_UART	sbgcOFF			/*!<  UART driver works with DMA through HAL										*/
	#define	SBGC_DRV_LL_NVIC_UART	sbgcOFF			/*!<  UART driver works with NVIC through LL										*/
	#define	SBGC_DRV_LL_DMA_UART	sbgcOFF			/*!<  UART driver works with DMA through LL											*/

	/*	Attention!
		*** Using UART CubeMX drivers except LL DMA
		copy this code into the USARTx_IRQHandler()
		function (if you are use HAL drivers - above
		the HAL_UART_IRQHandler(&huartx)) function
		in the stm32XXxx_it.c file:

		sbgcUART_IRQ_Handler(&SBGC32_Device);

		*** Using UART DMA CubeMX HAL driver
		be careful with CubeMX code generator.
		It may create the MX_DMAx_Init() function
		under the MX_USARTx_Init() function and then
		you will be need to lift it above. Otherwise
		the program will not work.

		Also, keep in mind that Rx DMA channel must
		work in the Circular mode.

		*** Using UART DMA CubeMX LL driver copy
		this code into the DMAx_Streamx_IRQHandler()
		functions in the stm32XXxx_it.c file:

		sbgcUART_DMA_TX_IRQ_Handler(&SBGC32_Device);

		- for DMA UART Tx channel.

		sbgcUART_DMA_RX_IRQ_Handler(&SBGC32_Device);

		- for DMA UART Rx channel.

		The 'SBGC32_Device' is a general SBGC32
		configurations structure.
	 */

	#define	SBGC_DRV_TX_BUFFER_SIZE	1				/*!<  1 Min (256 bytes) --> 7 Max (16384 bytes). Driver sent data buffer size		*/
	#define	SBGC_DRV_RX_BUFFER_SIZE	1				/*!<  1 Min (256 bytes) --> 7 Max (16384 bytes). Driver received data buffer size	*/

	#if (SBGC_NEED_DEBUG)
		#define	SBGC_DRV_USE_UART_DEBUG		sbgcOFF	/*!<  UART debug flag																*/
	#endif

	#if (SBGC_DRV_USE_CUBEMX == sbgcOFF)
		#if (SBGC_DRV_HAL_TIMER || SBGC_DRV_HAL_NVIC_UART || SBGC_DRV_HAL_DMA_UART)
			#include		"stm32f7xx_hal.h"
		#else
			#include		"stm32f7xx.h"
		#endif

		#if (SBGC_DRV_LL_TIMER)
			#include				"stm32f7xx_ll_tim.h"
		#endif

		#if (SBGC_DRV_LL_TIMER || SBGC_DRV_LL_NVIC_UART || SBGC_DRV_LL_DMA_UART)
			#include				"stm32f7xx_ll_bus.h"
			#include				"stm32f7xx_ll_pwr.h"
			#include				"stm32f7xx_ll_rcc.h"
			#include				"stm32f7xx_ll_system.h"
			#include				"stm32f7xx_ll_utils.h"

