basecamelectronics/sbgc32-serial-api/examples/STM32/MimicControl/Core/Inc/serialAPI_Config.h
			#if (SBGC_DRV_LL_NVIC_UART || SBGC_DRV_LL_DMA_UART)
				#include			"stm32f7xx_ll_usart.h"
				#include			"stm32f7xx_ll_gpio.h"

				#if (SBGC_DRV_LL_DMA_UART)
					#include		"stm32f7xx_ll_dma.h"
				#endif
			#endif
		#endif
	#endif
#endif

#if (SBGC_USE_STM32_DRIVER && (SBGC_SEVERAL_DEVICES == sbgcOFF))
	/* STM32 Driver Timer Configurations -----------
	 */
	/* Timer settings with CubeMX */
	#if (SBGC_DRV_USE_CUBEMX)
		#if (SBGC_DRV_HAL_TIMER)
			#define SBGC_REFERENCE_TIMER	&htim2	/*!<  HAL User defined timer object. Each SBGC32 device has its own self timer		*/

		#elif (SBGC_DRV_LL_TIMER)
			#define SBGC_REFERENCE_TIMER	TIM2	/*!<  LL User defined timer object. Each SBGC32 device has its own self timer		*/
		#endif
	#endif

	/* Timer settings without CubeMX */
	#if ((SBGC_DRV_USE_CUBEMX == sbgcOFF) && (SBGC_DRV_HAL_TIMER || SBGC_DRV_LL_TIMER))
		/** SBGCs timer instance object	*/
		#define	SBGC_TIMER_INSTANCE			TIM2

		/** SBGCs timer global interrupt. See IRQn_Type enumeration */
		#define	SBGC_TIMER_IRQN				TIM2_IRQn

		/** SBGCs timer interrupt vector. See g_pfnVectors in the STM32 startup file */
		#define	SBGC_TIMER_IRQ_HANDLER		TIM2_IRQHandler

		/** SBGCs timer interrupt priority */
		#define	SBGC_TIMER_IRQ_PRIORITY		5

		/** Clock frequency of SBGCs timer bus */
		#define	SBGC_TIMER_BUS_FREQ			108000000

		#if (SBGC_DRV_HAL_TIMER)
			#define	SBGC_TIMER_NAME			htim2	/*!<  User sample of HAL timer object												*/

			/** SBGCs timer clock enable function */
			#define	SBGC_TIMER_CLOCK_ENABLE			__HAL_RCC_TIM2_CLK_ENABLE()

			/** SBGCs timer clock disable function */
			#define	SBGC_TIMER_CLOCK_DISABLE		__HAL_RCC_TIM2_CLK_DISABLE()

		#else /* SBGC_DRV_LL_TIMER */
			/** SBGCs timer clock enable function */
			#define	SBGC_TIMER_CLOCK_ENABLE			LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM2)

			/** SBGCs timer clock disable function */
			#define	SBGC_TIMER_CLOCK_DISABLE		LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM2)
		#endif
	#endif

	/* STM32 Driver UART Configurations ------------
	 */
	/**	@cond
	 */
	/* UART settings with CubeMX */
	#if (SBGC_DRV_USE_CUBEMX)
		#if (SBGC_DRV_HAL_NVIC_UART || SBGC_DRV_HAL_DMA_UART)
			#define SBGC_SERIAL_PORT		&huart1	/*!<  HAL User defined UART object. Used to communicate with SBGC32 device 			*/

			#if (SBGC_DRV_USE_UART_DEBUG)
				/** HAL User defined UART object. Used to print debug data */
				#define	SBGC_DEBUG_SERIAL_PORT		&huart2
			#endif

		#elif (SBGC_DRV_LL_NVIC_UART || SBGC_DRV_LL_DMA_UART)
			#define SBGC_SERIAL_PORT		USART1	/*!<  LL User defined UART object. Used to communicate with SBGC32 device 			*/

			#if (SBGC_DRV_USE_UART_DEBUG)
				/** LL User defined UART object. Used to print debug data */
				#define SBGC_DEBUG_SERIAL_PORT		USART2
			#endif
		#endif
	#endif
	/**	@endcond
	 */

	#if (SBGC_DRV_LL_DMA_UART)
		#define	SBGC_DMA_UART_TX	DMA2			/*!<  LL User defined DMA object. Used to communicate with SBGC32 device 			*/
		#define	SBGC_DMA_UART_RX	DMA2			/*!<  LL User defined DMA object. Used to communicate with SBGC32 device 			*/

		/** LL User defined DMA channel object. Used to communicate with SBGC32 device */
		#define	SBGC_DMA_UART_TX_STREAM		LL_DMA_STREAM_7

		/** LL User defined DMA channel object. Used to communicate with SBGC32 device */
		#define	SBGC_DMA_UART_RX_STREAM		LL_DMA_STREAM_2

		/** Appointed in accordance with DMA_UART_TX_STREAM channel (TCx) */
		#define	SBGC_CLEAR_DMA_TC_TX		LL_DMA_ClearFlag_TC7(SBGC_DMA_UART_TX)

		/** Appointed in accordance with DMA_UART_RX_STREAM channel (TCx) */
		#define	SBGC_CLEAR_DMA_TC_RX		LL_DMA_ClearFlag_TC2(SBGC_DMA_UART_RX)

		/** Appointed in accordance with DMA_UART_TX_STREAM channel (TCx) */
		#define	SBGC_GET_FLAG_DMA_ISR_TC_TX	LL_DMA_IsActiveFlag_TC7(SBGC_DMA_UART_TX)

		/** Appointed in accordance with DMA_UART_RX_STREAM channel (TCx) */
		#define	SBGC_GET_FLAG_DMA_ISR_TC_RX	LL_DMA_IsActiveFlag_TC2(SBGC_DMA_UART_RX)
	#endif

	/* UART settings without CubeMX */
	#if (SBGC_DRV_USE_CUBEMX == sbgcOFF)
		/* SBGC UART (DMA) objects settings */
		#if (SBGC_DRV_HAL_DMA_UART || SBGC_DRV_HAL_NVIC_UART)
			#define	SBGC_UART_NAME	huart1			/*!<  User sample of HAL UART object												*/

			#if (SBGC_DRV_HAL_DMA_UART)
				#define	SBGC_UART_DMA_NAME	hdma2	/*!<  User sample of HAL UART DMA object											*/
			#endif
		#endif

		/* SBGC UART GPIO settings */
		#define	SBGC_UART_TX_GPIO_PORT		GPIOA	/*!<  SBGCs UART Tx port															*/
		#define	SBGC_UART_RX_GPIO_PORT		GPIOA	/*!<  SBGCs UART Rx port															*/

		#if (SBGC_DRV_HAL_NVIC_UART || SBGC_DRV_HAL_DMA_UART)
			/** SBGCs UART Tx pin */
			#define	SBGC_UART_TX_PIN		GPIO_PIN_9

			/** SBGCs UART Tx pin alternate function */
			#define	SBGC_UART_TX_PIN_AF		GPIO_AF7_USART1

			/** SBGCs UART Rx pin */
			#define	SBGC_UART_RX_PIN		GPIO_PIN_10

			/** SBGCs UART Rx pin alternate function */
			#define	SBGC_UART_RX_PIN_AF		GPIO_AF7_USART1

			/** SBGCs UART GPIO clock enable function */
			#define	SBGC_UART_GPIO_CLOCK_ENABLE		__HAL_RCC_GPIOA_CLK_ENABLE()

			/** SBGCs UART GPIO clock disable function */
			#define	SBGC_UART_GPIO_CLOCK_DISABLE	__HAL_RCC_GPIOA_CLK_DISABLE()

		#else /* SBGC_DRV_LL_NVIC_UART || SBGC_DRV_LL_NVIC_UART */
			/** SBGCs UART Tx pin */
			#define	SBGC_UART_TX_PIN		LL_GPIO_PIN_14

			/** SBGCs UART Tx pin alternate function */
			#define	SBGC_UART_TX_PIN_AF		LL_GPIO_AF_4

			/** SBGCs UART Rx pin */
			#define	SBGC_UART_RX_PIN		LL_GPIO_PIN_15

			/** SBGCs UART Rx pin alternate function */
			#define	SBGC_UART_RX_PIN_AF		LL_GPIO_AF_4

			/** SBGCs UART GPIO clock enable function */
			#define	SBGC_UART_GPIO_CLOCK_ENABLE		LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOB)

			/** SBGCs UART GPIO clock disable function */
			#define	SBGC_UART_GPIO_CLOCK_DISABLE	LL_AHB1_GRP1_DisableClock(LL_AHB1_GRP1_PERIPH_GPIOB)
		#endif

		/* SBGC UART module settings */
		#define	SBGC_UART_SERIAL_SPEED		115200	/*!<  SBGCs UART serial speed														*/

		#define	SBGC_UART_INSTANCE	USART1			/*!<  SBGCs UART instance object													*/
		#define SBGC_UART_IRQN		USART1_IRQn		/*!<  SBGCs UART global interrupt. See IRQn_Type enumeration						*/

		/**  SBGCs UART interrupt vector. See g_pfnVectors in the STM32 startup file */
		#define SBGC_UART_IRQ_HANDLER		USART1_IRQHandler

		#define	SBGC_UART_IRQ_PRIORITY		5		/*!<  SBGCs UART interrupt priority													*/

		#if (SBGC_DRV_HAL_NVIC_UART || SBGC_DRV_HAL_DMA_UART)
			/** SBGCs UART clock enable function */
			#define SBGC_UART_CLOCK_ENABLE	__HAL_RCC_USART1_CLK_ENABLE()

			/** SBGCs UART clock disable function */
			#define SBGC_UART_CLOCK_DISABLE	__HAL_RCC_USART1_CLK_DISABLE()

		#else /* SBGC_DRV_LL_NVIC_UART || SBGC_DRV_LL_DMA_UART */
			/** SBGCs UART clock enable function */
			#define SBGC_UART_CLOCK_ENABLE	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1)

			/** SBGCs UART clock disable function */
			#define SBGC_UART_CLOCK_DISABLE	LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_USART1)

			/** Peripheral UART clock source selection. See LL RCC driver file */
			#define	SBGC_UART_CLOCK_SRC		LL_RCC_USART1_CLKSOURCE_PCLK2
		#endif

