basecamelectronics/sbgc32-serial-api/examples/STM32/MimicControl/Core/Inc/serialAPI_Config.h
		#if (SBGC_DRV_HAL_DMA_UART || SBGC_DRV_LL_DMA_UART)
			/* SBGC UART DMA module settings */
			/** SBGCs UART DMA Tx channel global interrupt. See IRQn_Type enumeration */
			#define	SBGC_UART_DMA_TX_CH_IRQN		DMA2_Stream7_IRQn

			/** SBGCs UART DMA Rx channel global interrupt. See IRQn_Type enumeration */
			#define	SBGC_UART_DMA_RX_CH_IRQN		DMA2_Stream2_IRQn

			/** SBGCs UART DMA Tx channel interrupt vector. See g_pfnVectors in the STM32 startup file */
			#define SBGC_UART_DMA_TX_CH_IRQ_HANDLER	DMA2_Stream7_IRQHandler

			/** SBGCs UART DMA Rx channel interrupt vector. See g_pfnVectors in the STM32 startup file */
			#define SBGC_UART_DMA_RX_CH_IRQ_HANDLER	DMA2_Stream2_IRQHandler

			#if (SBGC_DRV_HAL_DMA_UART)
				/** SBGCs UART DMA Tx channel. See HAL DMA extension module file and DMAx request mapping in a reference manual */
				#define SBGC_UART_DMA_TX_CHANNEL	DMA_CHANNEL_4

				/** SBGCs UART DMA Rx channel. See HAL DMA extension module file and DMAx request mapping in a reference manual */
				#define SBGC_UART_DMA_RX_CHANNEL	DMA_CHANNEL_4

				/** SBGCs UART DMA Tx base stream */
				#define SBGC_UART_DMA_TX_INSTANCE	DMA2_Stream7

				/** SBGCs UART DMA Rx base stream */
				#define SBGC_UART_DMA_RX_INSTANCE	DMA2_Stream2

				/** SBGCs UART DMA clock enable function */
				#define	SBGC_UART_DMA_CLOCK_ENABLE	__HAL_RCC_DMA2_CLK_ENABLE()

				/** SBGCs UART DMA clock disable function */
				#define	SBGC_UART_DMA_CLOCK_DISABLE	__HAL_RCC_DMA2_CLK_DISABLE()

			#else
				/** SBGCs UART DMA Tx channel. See LL DMA extension module file and DMAx request mapping in a reference manual */
				#define SBGC_UART_DMA_TX_CHANNEL	LL_DMA_CHANNEL_4

				/** SBGCs UART DMA Rx channel. See LL DMA extension module file and DMAx request mapping in a reference manual */
				#define SBGC_UART_DMA_RX_CHANNEL	LL_DMA_CHANNEL_4

				/** SBGCs UART DMA clock enable function */
				#define	SBGC_UART_DMA_CLOCK_ENABLE	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA2)

				/** SBGCs UART DMA clock disable function */
				#define	SBGC_UART_DMA_CLOCK_DISABLE	LL_AHB1_GRP1_DisableClock(LL_AHB1_GRP1_PERIPH_DMA2)
			#endif
		#endif
	#endif

	#if ((SBGC_DRV_USE_CUBEMX == sbgcOFF) && SBGC_DRV_USE_UART_DEBUG)
		/* Debug UART settings */
		#if (SBGC_DRV_HAL_DMA_UART || SBGC_DRV_HAL_NVIC_UART)
			/** User sample of HAL UART object */
			#define	SBGC_DEBUG_UART_NAME	huart2
		#endif

		/* Debug UART module settings */
		/** Debug UART serial speed */
		#define	SBGC_DEBUG_UART_SERIAL_SPEED		115200

		/** Debug UART instance object */
		#define	SBGC_DEBUG_UART_INSTANCE			USART2

		/* Debug UART GPIO settings */
		/** Debug UART Tx port */
		#define	SBGC_DEBUG_UART_TX_GPIO_PORT		GPIOA

		/** Debug UART Rx port */
		#define	SBGC_DEBUG_UART_RX_GPIO_PORT		GPIOA

		#if (SBGC_DRV_HAL_NVIC_UART || SBGC_DRV_HAL_DMA_UART)
			/** Debug UART Tx pin */
			#define	SBGC_DEBUG_UART_TX_PIN			GPIO_PIN_2

			/** Debug UART Tx pin alternate function */
			#define	SBGC_DEBUG_UART_TX_PIN_AF		GPIO_AF7_USART2

			/** Debug UART Rx pin */
			#define	SBGC_DEBUG_UART_RX_PIN			GPIO_PIN_3

			/** Debug UART Rx pin alternate function */
			#define	SBGC_DEBUG_UART_RX_PIN_AF		GPIO_AF7_USART2

			/** Debug UART GPIO clock enable function */
			#define	SBGC_DEBUG_UART_GPIO_CLOCK_ENABLE\
													__HAL_RCC_GPIOA_CLK_ENABLE()

			/** Debug UART GPIO clock disable function */
			#define	SBGC_DEBUG_UART_GPIO_CLOCK_DISABLE\
													__HAL_RCC_GPIOA_CLK_DISABLE()

		#else /* SBGC_DRV_LL_NVIC_UART || SBGC_DRV_LL_NVIC_UART */
			/** Debug UART Tx pin */
			#define	SBGC_DEBUG_UART_TX_PIN			LL_GPIO_PIN_2

			/** Debug UART Tx pin alternate function */
			#define	SBGC_DEBUG_UART_TX_PIN_AF		LL_GPIO_AF_7

			/** Debug UART Rx pin */
			#define	SBGC_DEBUG_UART_RX_PIN			LL_GPIO_PIN_3

			/** Debug UART Rx pin alternate function */
			#define	SBGC_DEBUG_UART_RX_PIN_AF		LL_GPIO_AF_7

			/** Debug UART GPIO clock enable function */
			#define	SBGC_DEBUG_UART_GPIO_CLOCK_ENABLE\
													LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA)

			/** Debug UART GPIO clock disable function */
			#define	SBGC_DEBUG_UART_GPIO_CLOCK_DISABLE\
													LL_AHB1_GRP1_DisableClock(LL_AHB1_GRP1_PERIPH_GPIOA)
		#endif

		#if (SBGC_DRV_HAL_NVIC_UART || SBGC_DRV_HAL_DMA_UART)
			/** Debug UART clock enable function */
			#define SBGC_DEBUG_UART_CLOCK_ENABLE	__HAL_RCC_USART2_CLK_ENABLE()

			/** Debug UART clock disable function */
			#define SBGC_DEBUG_UART_CLOCK_DISABLE	__HAL_RCC_USART2_CLK_DISABLE()

		#else /* SBGC_DRV_LL_NVIC_UART || SBGC_DRV_LL_DMA_UART */
			/** Debug UART clock enable function */
			#define SBGC_DEBUG_UART_CLOCK_ENABLE	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2)

			/** Debug UART clock disable function */
			#define SBGC_DEBUG_UART_CLOCK_DISABLE	LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART2)

			/** Peripheral UART clock source selection. See LL RCC driver file */
			#define	SBGC_DEBUG_UART_CLOCK_SRC		LL_RCC_USART1_CLKSOURCE_PCLK2
		#endif
	#endif
	/**	@}
	 */
#endif /* SBGC_USE_STM32_DRIVER */
/**	@}
 */

/*  = = = = = = = = = = = = = = = = = = = = = = = */
#ifdef 		__cplusplus
			}
#endif

#endif		/* SERIAL_API_CONFIG_TEMPLATE_H_ */
